Logistic Regression <br>
Dataset: Social network ads

In [1]:
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt
%matplotlib inline

In [2]:
df=pd.read_csv('Social_Network_Ads.csv')

In [3]:
df.head()

    User ID  Gender  Age  EstimatedSalary  Purchased
0  15624510    Male   19            19000          0
1  15810944    Male   35            20000          0
2  15668575  Female   26            43000          0
3  15603246  Female   27            57000          0
4  15804002    Male   19            76000          0

In [4]:
df.shape

(400, 5)

In [5]:
df.isnull().sum()

User ID            0
Gender             0
Age                0
EstimatedSalary    0
Purchased          0
dtype: int64

No null values.

In [6]:
df['Purchased'].value_counts()

0    257
1    143
Name: Purchased, dtype: int64

In [7]:
df = df.drop('User ID', axis = 1)

In [8]:
df.head()

   Gender  Age  EstimatedSalary  Purchased
0    Male   19            19000          0
1    Male   35            20000          0
2  Female   26            43000          0
3  Female   27            57000          0
4    Male   19            76000          0

Convert categorical variables to numeric

In [10]:
from sklearn.preprocessing import OneHotEncoder
df_onehot = pd.get_dummies(df, columns=['Gender'], prefix = ['Gender'])
df_onehot

     Age  EstimatedSalary  Purchased  Gender_Female  Gender_Male
0     19            19000          0              0            1
1     35            20000          0              0            1
2     26            43000          0              1            0
3     27            57000          0              1            0
4     19            76000          0              0            1
..   ...              ...        ...            ...          ...
395   46            41000          1              1            0
396   51            23000          1              0            1
397   50            20000          1              1            0
398   36            33000          0              0            1
399   49            36000          1              1            0

[400 rows x 5 columns]

Normalisation

In [12]:
from sklearn.preprocessing import MinMaxScaler

scaler=MinMaxScaler(feature_range=(0,1))
df_onehot["EstimatedSalary"]=scaler.fit_transform(df_onehot[["EstimatedSalary"]])
df_onehot

     Age  EstimatedSalary  Purchased  Gender_Female  Gender_Male
0     19         0.029630          0              0            1
1     35         0.037037          0              0            1
2     26         0.207407          0              1            0
3     27         0.311111          0              1            0
4     19         0.451852          0              0            1
..   ...              ...        ...            ...          ...
395   46         0.192593          1              1            0
396   51         0.059259          1              0            1
397   50         0.037037          1              1            0
398   36         0.133333          0              0            1
399   49         0.155556          1              1            0

[400 rows x 5 columns]

Putting the Purchased column in the end

In [14]:
Column_loc = ['Age','EstimatedSalary','Gender_Female','Gender_Male','Purchased']
df_onehot = df_onehot[Column_loc]
df_onehot.head()

   Age  EstimatedSalary  Gender_Female  Gender_Male  Purchased
0   19         0.029630              0            1          0
1   35         0.037037              0            1          0
2   26         0.207407              1            0          0
3   27         0.311111              1            0          0
4   19         0.451852              0            1          0

In [1]:
X = df_onehot.iloc[:,:-1].values #[all rows: all columns except purchased]
y = df_onehot.iloc[:,-1].values  #[all rows: purchased column]

NameError: name 'df_onehot' is not defined

Split the data into training and testing

In [16]:
from sklearn.model_selection import train_test_split
train_X, test_X, train_y, test_y = train_test_split(X, y, test_size= 0.25, random_state = 4)
print(train_X.shape,train_y.shape,test_X.shape,test_y.shape)

(300, 4) (300,) (100, 4) (100,)

In [17]:
from sklearn.linear_model import LogisticRegression
lr = LogisticRegression()
lr.fit(train_X,train_y)#fit the model on training data

LogisticRegression()

In [18]:
predict_y = lr.predict(test_X)

In [19]:
predict_y

array([0, 0, 0, 0, 0, 1, 1, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
       0, 1, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 1, 0, 0, 0, 0, 0, 0, 0,
       0, 0, 0, 0, 1, 1, 0, 0, 0, 1, 1, 0, 1, 0, 0, 1, 1, 1, 0, 0, 0, 0,
       0, 0, 1, 1, 0, 1, 0, 1, 1, 0, 0, 0, 0, 1, 0, 0, 1, 0, 0, 0, 0, 0,
       1, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 1])

In [20]:
from sklearn.metrics import accuracy_score
accuracy_score(test_y, predict_y)

0.86

In [21]:
from sklearn.metrics import confusion_matrix, roc_auc_score, precision_score, recall_score
print(roc_auc_score(test_y, predict_y))
print(precision_score(test_y, predict_y))
print(recall_score(test_y, predict_y))

0.8142857142857143
0.8076923076923077
0.7

In [22]:
print(confusion_matrix(test_y, predict_y))
tp,fp, fn, tn = confusion_matrix(test_y, predict_y).ravel()
print(f'Correctly Predicted made Purchase {tp}')
print(f'Falsely Predicted made Purchase {fp}')
print(f'Falsely Predicted made did NOT made Purchase {fn}')
print(f'Correctly Predicted made did NOT made Purchase {tn}')

[[65  5]
 [ 9 21]]
Correctly Predicted made Purchase 65
Falsely Predicted made Purchase 5
Falsely Predicted made did NOT made Purchase 9
Correctly Predicted made did NOT made Purchase 21